#include <unistd.h>


int main(int argc, char** argv)
{
    if (argc < 5)
        return 1;

    // броят на командите е равен на половината от командните аргументи
    int cmdc = (argc - 1) / 2 - 1;

    // начало на пренасочването на стандартния изход на първата команда
    int fdsr[2], fdsw[2];

    // създаваме нов канал за писане
    pipe(fdsw);

    // конкуретнтно изпълнение
    if (!fork())
    {
        // затваряме четящия край на канала за писане, тъй като няма да ни е нужен в този случай
        close(fdsw[0]);

        // пренасочваме стандартния изход към пишещия файлов дескриптор на канала за писане
        close(1);
        dup(fdsw[1]);

        // изпълняваме първата команда, чиито аргументи са съответно първият и вторият, подадени на командния ред
        execlp(argv[1], argv[1], argv[2], NULL);
    }
    // край на пренасочването на стандартния изход на първата команда

    // начало на пренасочването на междинните команди
    for (int i = 1; i < cmdc; i++)
    {
        // за всяка следваща команда каналите за четене са същите като каналите за писане на предишната
        fdsr[0] = fdsw[0];
        fdsr[1] = fdsw[1];

        // създаваме нов канал за писане
        pipe(fdsw);

        // затваряме пишещия край на канала за четене, тъй като няма да ни е нужен в този случай
        close(fdsr[1]);

        if (!fork())
        {
            // затваряме четящия край на канала за писане, тъй като няма да ни е нужен в този случай
            close(fdsw[0]);

            // пренасочваме стандартния вход от четящия файлов дескриптор на канала за четене
            close(0);
            dup(fdsr[0]);
            // пренасочваме стандартния изход към пишещия файлов дескриптор на канала за писане
            close(1);
            dup(fdsw[1]);

            // изпълняваме i-ата команда, чиито аргументи са съответно (2*i+1)-ият и (2*i+2)-ият, подадени на командния ред
            execlp(argv[2 * i + 1], argv[2 * i + 1], argv[2 * i + 2], NULL);
        }

        // затваряме четящия край на канала за четене, тъй като няма да ни е нужен повече
        close(fdsr[0]);
    }

    // и за последната команда каналите за четене са същите като каналите за писане на предишната
    fdsr[0] = fdsw[0];
    fdsr[1] = fdsw[1];

    // затваряме пишещия край на канала за четене, тъй като няма да ни е нужен в този случай
    close(fdsr[1]);

    // пренасочваме стандартния вход от четящия файлов дескриптор на канала за четене
    close(0);
    dup(fdsr[0]);

    // изпълняваме последната команда, чиито аргументи са съответно предпоследният и последният, подадени на командния ред
    execlp(argv[2 * cmdc + 1], argv[2 * cmdc + 1], argv[2 * cmdc + 2], NULL);
}
